refume/app/views/microposts/discussion.html.erb

        </div>
    <% Micropost.all.entries.reverse.each do | entry | %>
---
SELECT "microposts".* FROM "microposts"