refume/app/controllers/matches_controller.rb

  def create
    @user = current_user
    @match = Match.new(match_params)

    respond_to do |format|
      if @match.save
---
INSERT INTO "matches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-02-18 08:21:02.747110"], ["updated_at", "2020-02-18 08:21:02.747110"]]