refume/app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts"
---
	def index
		# @posts = Micropost.where({category_id: Category.find(valid_item)})
		@posts = Micropost.all