refume/app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "asda"], ["created_at", "2020-02-29 05:58:22.517562"], ["updated_at", "2020-02-29 05:58:22.517562"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save