refume/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ben@ben.com"], ["LIMIT", 1]]
---
  def create
    # input is in this format { session: { password: "foobar", email: "user@example.com" } }
    # that's why we need nested hash
    user = User.find_by(email: params[:session][:email].downcase)