refume/app/controllers/users_controller.rb

  def show
    #find_by method automatically does the sanity check on user input
    #to prevent SQL injection
    #@user = User.find(params[:id])
    @user = User.find_by_id(params[:id])
    #get all the matched mentors/mentees for this user
    @matches = nil
    if @user.role == "Mentee"
      @matches = Match.where(mentee_id: @user.id)
    elsif @user.role == "Mentor"
      @matches = Match.where(mentor_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."mentee_id" = ?  [["mentee_id", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."mentor_id" = ?  [["mentor_id", 4]]

  def create

=begin
    encrypted_user_params = {}
    user_params.each do |key, value|
      if key != 'password' && key != 'password_confirmation'
        encrypted_user_params[key] = SymmetricEncryption.encrypt(value)
      else
        encrypted_user_params[key] = value
      end
    end

    p "_________________"
    p encrypted_user_params
    p "_________________"
=end
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "age", "zipcode", "country", "goals", "created_at", "updated_at", "password_digest", "language", "bio", "activation_digest", "role") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find_by_id(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "age" = ?, "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 22], ["bio", ""], ["updated_at", "2020-02-13 22:14:20.503265"], ["id", 7]]